In [1]:
import xlsxwriter

In [2]:
workbook=xlsxwriter.Workbook('details.xlsx')
worksheet=workbook.add_worksheet()

In [6]:
n_subjects=int(input('Enter number of the subjects:'))


header=['Name']
for s in range(n_subjects):
    header.append(input(f'Enter the subject{s+1} name: '))
    
header

Enter number of the subjects:4
Enter the subject1 name: ar
Enter the subject2 name: en
Enter the subject3 name: fr
Enter the subject4 name: math

['Name', 'ar', 'en', 'fr', 'math']

In [7]:
for col in range(len(header)):
    worksheet.write(0,col,header[col])

In [8]:
for n in range(int(input('Enter n of students:'))):
    worksheet.write(n+1,0,input('Enter ur name'))
    for i in range(1,len(header)):
        worksheet.write(n+1,i,int(input(f'Enter {header[i]} grade:')))

Enter n of students:4
Enter ur namesara
Enter ar grade:22
Enter en grade:44
Enter fr grade:55
Enter math grade:11
Enter ur namemg
Enter ar grade:33
Enter en grade:77
Enter fr grade:88
Enter math grade:33
Enter ur nameff
Enter ar grade:44
Enter en grade:77
Enter fr grade:88
Enter math grade:99
Enter ur namedd
Enter ar grade:44
Enter en grade:22
Enter fr grade:33
Enter math grade:55

In [9]:
workbook.close()

In [10]:
import pandas as pd

In [11]:
df=pd.read_excel('details.xlsx')
df

   Name  ar  en  fr  math
0  sara  22  44  55    11
1    mg  33  77  88    33
2    ff  44  77  88    99
3    dd  44  22  33    55

In [12]:
df.describe()

              ar         en         fr       math
count   4.000000   4.000000   4.000000   4.000000
mean   35.750000  55.000000  66.000000  49.500000
std    10.531698  26.944387  26.944387  37.572153
min    22.000000  22.000000  33.000000  11.000000
25%    30.250000  38.500000  49.500000  27.500000
50%    38.500000  60.500000  71.500000  44.000000
75%    44.000000  77.000000  88.000000  66.000000
max    44.000000  77.000000  88.000000  99.000000

In [13]:
df

   Name  ar  en  fr  math
0  sara  22  44  55    11
1    mg  33  77  88    33
2    ff  44  77  88    99
3    dd  44  22  33    55

In [14]:
df['Name']

0    sara
1      mg
2      ff
3      dd
Name: Name, dtype: object

In [15]:
len(df)

4

In [16]:
df.iloc[2]

Name    ff
ar      44
en      77
fr      88
math    99
Name: 2, dtype: object

In [19]:
df.loc[4]=['dd',33,55,66,77]

In [20]:
df

   Name  ar  en  fr  math
0  sara  22  44  55    11
1    mg  33  77  88    33
2    ff  44  77  88    99
3    dd  44  22  33    55
4    dd  33  55  66    77

In [21]:
df.to_excel('details.xlsx',sheet_name='sheet2')

In [35]:
df.describe()

             ar         en         fr       math
count   5.00000   5.000000   5.000000   5.000000
mean   35.20000  55.000000  66.000000  55.000000
std     9.20326  23.334524  23.334524  34.785054
min    22.00000  22.000000  33.000000  11.000000
25%    33.00000  44.000000  55.000000  33.000000
50%    33.00000  55.000000  66.000000  55.000000
75%    44.00000  77.000000  88.000000  77.000000
max    44.00000  77.000000  88.000000  99.000000

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   ar      5 non-null      int64
 2   en      5 non-null      int64
 3   fr      5 non-null      int64
 4   math    5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 240.0+ bytes

In [25]:
import csv

In [33]:
header=['name']
header.extend([input('enter subject name: ') for i in range(int(input('Enter no of subjects')))])

Enter no of subjects3
enter subject name: ar
enter subject name: en
enter subject name: math

In [34]:
header

['name', 'ar', 'en', 'math']

In [45]:


with open('details2.csv','w',encoding='utf-8',newline='') as f:
    w=csv.writer(f)
    w.writerow(header)
    for i in range(int(input('no of students: '))):
        row=[input('Enter ur name: ')]
        for sub in range(1,len(header)):
            row.append(int(input(f'Enter {header[sub]} grade: ')))
        
        w.writerow(row)

KeyboardInterrupt: Interrupted by user

In [42]:
df=pd.read_csv('details2.csv')
df

   name  ar  en  math
0  sara  33  55    66
1    mg  33  77    88
2    ss  22  55    88

In [43]:
df.describe()

              ar         en       math
count   3.000000   3.000000   3.000000
mean   29.333333  62.333333  80.666667
std     6.350853  12.701706  12.701706
min    22.000000  55.000000  66.000000
25%    27.500000  55.000000  77.000000
50%    33.000000  55.000000  88.000000
75%    33.000000  66.000000  88.000000
max    33.000000  77.000000  88.000000

In [50]:
header=['name']
header.extend([input('enter subject name: ') for i in range(int(input('Enter no of subjects')))])

with open('details2.csv','w',newline='') as f:
    w=csv.writer(f)
    w.writerow(header)
    while True:
        opt=int(input('enter ur option no \n 1-add \n 2-exit \n'))
        if opt==2:
            break
        row=[input('enter ur name: ')]
        row.extend([int(input(f'Enter {header[sub]} grade: ')) for sub in range(1,len(header))])
        w.writerow(row)

KeyboardInterrupt: Interrupted by user

In [51]:

df=pd.read_csv('details2.csv')
df

      name  ar  en  math
0  mohamed  33  55    77
1       qq  55  88    99
2       rr  33  22    44

In [56]:
list(df.columns)

['name', 'ar', 'en', 'math']

In [58]:
df=pd.read_csv('details2.csv')
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0
3       kk   NaN   NaN   NaN
4       hh   NaN   NaN   NaN
5       hh   NaN   NaN   NaN

In [59]:
df.drop([3,4,5],axis=0,inplace=True)
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0

In [60]:
df_2=df.drop('ar',axis=1)
df_2

      name    en  math
0  mohamed  55.0  77.0
1       qq  88.0  99.0
2       rr  22.0  44.0

In [61]:
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0

In [62]:
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0

In [64]:
list(df.columns)

['name', 'ar', 'en', 'math']

In [76]:
df.to_csv('details2.csv')

In [85]:

header=list(df.columns)
with open('details2.csv','a',newline='') as f:
    w=csv.writer(f)
    while True:
        opt=int(input('enter ur option no \n 1-add \n 2-exit \n'))
        if opt==2:
            break
        row=[input('enter ur name: ')]
        row.extend([int(input(f'Enter {header[sub]} grade: ')) for sub in range(1,len(header))])
        w.writerow(row)

enter ur option no
 1-add
 2-exit
1
enter ur name: ll
Enter ar grade: 88
Enter en grade: 66
Enter math grade: 44
enter ur option no
 1-add
 2-exit
1
enter ur name: qq
Enter ar grade: 44
Enter en grade: 88
Enter math grade: 11
enter ur option no
 1-add
 2-exit
2

In [86]:
df=pd.read_csv('details2.csv')
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0
3       ll  88.0  66.0  44.0
4       qq  44.0  88.0  11.0

In [75]:
header

['Unnamed: 0', 'name', 'ar', 'en', 'math']

In [78]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [81]:
df.drop([3,4],axis=0,inplace=True)

In [82]:
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0

In [83]:
df.to_csv('details2.csv',index=False)

In [84]:
df=pd.read_csv('details2.csv')
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0

In [87]:
df=pd.read_excel('details.xlsx')
df

   Unnamed: 0  Name  ar  en  fr  math
0           0  sara  22  44  55    11
1           1    mg  33  77  88    33
2           2    ff  44  77  88    99
3           3    dd  44  22  33    55
4           4    dd  33  55  66    77

In [89]:
df.drop('Unnamed: 0',axis=1,inplace=True)
df

   Name  ar  en  fr  math
0  sara  22  44  55    11
1    mg  33  77  88    33
2    ff  44  77  88    99
3    dd  44  22  33    55
4    dd  33  55  66    77

In [91]:
df.to_csv('test.csv',index=False)

In [92]:
df=pd.read_csv('test.csv')
df

   Name  ar  en  fr  math
0  sara  22  44  55    11
1    mg  33  77  88    33
2    ff  44  77  88    99
3    dd  44  22  33    55
4    dd  33  55  66    77

In [93]:
import csv

In [94]:
df=pd.read_csv('details2.csv')
df

      name    ar    en  math
0  mohamed  33.0  55.0  77.0
1       qq  55.0  88.0  99.0
2       rr  33.0  22.0  44.0
3       ll  88.0  66.0  44.0
4       qq  44.0  88.0  11.0
5       oo  33.0  66.0  11.0
6       pp  33.0  99.0  22.0